<template>
  <div class='userProtocol-page' ref='userProtocolPage'>
    <Header name='userProtocol'></Header>

    <div class="banner">分布式存储云协议</div>

    <div class="content-area">
      <div class="h2">总则：</div>
      <p class="p">
        分布式存储云平台（以下简称“分布式存储云平台”）所提供的各项服务的所有权和运作权均归储算科技公司所有。《用户协议》（以下简称“本协议”）是由储算科技公司就各项服务所订立的相关权利义务规范。用户通过访问和/或使用本网站，即表示接受并同意本协议的所有条件和条款。使用租赁服务的分布式存储云平台用户（以下简称“用户”）通过访问和/或使用分布式存储云平台，在注册页面勾选“我已阅读并同意《用户协议》”，即表示接受并同意本协议的所有条件和条款。愿接受本协议条款的，可租赁分布式存储云平台的产品，储算科技公司作为产品提供者与运营者依据本协议为用户提供服务。储算科技公司有权对本协议条款进行修改并向用户作出提示，用户继续访问或使用储算科技公司产品的，则表示认可该最新协议。若用户不同意最新协议的部分或者全部内容的，则用户可以终止访问或使用分布式存储云平台及储算科技公司的租赁服务。
      </p>
      <div class='h1'>一、声明及风险控制</div>

      <p class='p'>1.1 声明</p>
      <p class='p indent'>
        1.1.1
        储算科技公司在此依法做出特别声明如下：储算科技公司采取合理的方式提请用户注意的义务将通过如下方式实现：在本协议中以明确的足以引起用户注意的加重字体、斜体、下划线、顔色标记等合理方式提醒用户注意相关条款（需要强调的是，还包括用户应特别注意任何未明确标记的含有“不承担”、“免责”“不得”等形式用语的条款），该等条款的确认将导致用户在特定情况下的被动、不便、损失，包括但不限于本协议第1条、第2条、第5条、第6条等，请用户在确认同意本协议之前再次阅读上述条款。储算科技公司尊重用户的权利尤其是诉讼的权利，储算科技公司在尊重用户诉讼权利的同时提议诉讼管辖地法院为香港高等法院，而用户选择同意注册或使用储算科技公司服务即视为双方对此约定达成了一致意见。
      </p>

      <p class="p indent">
        1.1.2
        储算科技公司向用户说明这些条款的义务将通过如下方式实现：用户如有任何需要说明条款的要求，请立即停止租赁或使用储算科技公司提供的服务；若用户未致电至储算科技公司而选择同意该协议或租赁或继续使用储算科技公司提供的服务，则双方在此确认储算科技公司已依法履行了根据用户要求对相关条款进行说明的法定义务，储算科技公司已给予用户充足的时间与充分的选择权来决定是否缔结本协议。
      </p>

      <p class="p indent">
        1.1.3
        鉴于储算科技公司已依法明确了上述条款、履行了格式条款制订方的义务，用户点击立即注册或使用储算科技公司服务，将被视为且应当被视为用户已经完全清楚明白并同意了本协议所有条款尤其是提醒用户注意的条款的合法性及有效性，用户不应当以储算科技公司未对格式条款以合理方式提醒用户注意或未根据用户要求尽到说明义务为理由而声称或要求法院或其他任何第三方确认相关条款非法或无效。
      </p>

      <p class="p underline  indent">
        1.1.4 一旦您勾选“我已阅读并同意《用户协议》”，即表示接受并同意本协议的所有条件和条款。本协议在您支付租赁费用后立即生效，您将无法申请退款。
      </p>

      <p class="p  indent">
        1.1.5
        储算科技公司不对用户相关信息的保存、修改、删除或储存失败负责。对非因储算科技公司故意所导致的排字错误、疏忽等不承担责任。储算科技公司有权但无义务，改善或更正储算科技公司任何部分之疏漏、错误。
      </p>

      <p class="p indent">
        1.1.6
        除非储算科技公司以书面协议形式明确约定，储算科技公司对于用户以任何方式从储算科技公司所获得的任何内容信息，不保证其准确性、完整性、可靠性；对于用户因与储算科技公司服务产品页面上的内容信息而租赁、获取的任何产品、服务、信息或资料，储算科技公司不承担责任。用户自行承担使用储算科技公司信息内容所导致的风险。
      </p>

      <p class="p indent">
        1.1.7
        储算科技公司将通过正式的页面公告、包括但不限于站内信、电子邮件、客服电话、手机短信或常规的信件方式发送，并且发送通知即为送达。任何非经储算科技公司正规管道获得的信息，储算科技公司不承担法律责任。
      </p>

      <p class="p indent">
        1.1.8
        若用户与第三方之间、用户与用户之间、用户与储算科技公司之间发生争议的，储算科技公司有权查看、审阅用户在储算科技公司发生的各种行为轨迹，并有权将该等内容提交给第三方或者媒体及政府相关部门而不需要另行通知到用户。用户确定储算科技公司所保存的电子数据将作为证据使用，且用户以及储算科技公司均同意该等证据不需要进行公证即视为合法有效的证据，而不论电子数据以任何形式、任何方式存储在任何地点。
      </p>

      <div class='h1'>二、用户租赁前须知</div>
      <p class="p">
        2.1
        为保障用户的合法权益，维护储算科技公司产品的正常运作，储算科技公司的产品使用者应当同意本协议的全部条款并按照页面上相应的提示完成租赁手续，成为储算科技公司服务的使用用户，享有储算科技公司租赁服务权益，并承担相关义务。
      </p>

      <p class="p">
        2.2
        本协议为储算科技公司针对分布式存储云平台用户使用储算科技公司租赁服务拟定的专属协议，用户继续访问和/或使用分布式存储云平台以及储算科技公司租赁服务的，则表示其认可并愿意接受公示信息所约定的规则，若用户不同意本协议所约定的规则，则用户可以终止访问和/或使用分布式存储云平台以及储算科技公司租赁服务。
      </p>

      <p class="p underline">
        2.3
        本协议的的最终解释权归储算科技公司所有，储算科技公司用户对文字的理解产生障碍的，可以通过向储算科技公司的服务邮箱（****@***.io）发送邮件的方式或通过指定的官方客服微信号要求储算科技公司进行解释。
      </p>

      <div class='h1'>三、服务内容</div>

      <p class="p">3.1 本协议中“用户”指具备完全民事行为能力且能够正常使用分布式存储云平台以及储算科技公司服务的主体，且具备相应的风险承担能力。</p>

      <p class="p">3.2 用户提供的注册资料，表示用户同意：</p>

      <p class="p indent">3.2.1 储算科技公司可以通过分布式存储云平台获取用户向分布式存储云平台提供的个人资料，用户保证提供合法、真实、准确、详尽的个人资料；</p>

      <p class="p indent">
        3.2.2
        如先前提供的资料有变动，及时更新分布式存储云平台以及储算科技公司的用户资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且储算科技公司保留终止用户使用储算科技公司服务的权利；
      </p>

      <div class='h1'>四、服务内容</div>
      <p class="p">
        4.1
        用户在接受储算科技公司服务的同时，同意接受储算科技公司提供的各类有关其产品的信息服务。用户在此授权储算科技公司或储算科技公司委托方可以向其电子邮件、手机、通信地址、实时聊天工具等发送信息。
      </p>

      <p class="p">
        4.2
        储算科技公司提供给用户的信息可能随时发生变动，储算科技公司对此不做特别通知。受互联网技术发展水平等客观因素的限制，分布式存储云平台以及储算科技公司页面显示的信息可能会有一定的滞后性或差错，对此情形用户表示清楚明白。
      </p>

      <p class="p">
        4.3
        如果用户根据本协议使用储算科技公司服务的行为是非法的或者可能被认定为非法、扰乱市场的，包括但不限于洗钱、从事或支持恐怖行为、威胁第三方、参与具有组织性的行动且该等行动可能被认为对市场造成波动的，则储算科技公司有权停止对用户的服务。
      </p>

      <p class="p">
        4.4
        储算科技公司有权在法律法规允许的范围内，结合业务发展等实际情况，调整储算科技公司服务范围、各项功能和收费标准，并通过分布式存储云平台以及储算科技公司旗下的其他网站或有权限的相关联方公告等方式及时通知用户。
      </p>

      <p class="p">
        4.5
        储算科技公司与用户一致确认，在发生争议时，储算科技公司所维护的服务器以及其他电子设备中所记录或保留的记录应当作为证据使用，双方对此均予以认可，而不论该等服务器或者电子设备由储算科技公司直接或者委托的第三方保管。
      </p>

      <div class='h1'>五、用户信息的保密</div>

      <p class="p">5.1 本协议所称之用户信息是指符合法律、法规及相关规定，并符合下述范围的信息：</p>

      <p class="p indent">5.1.1 用户注册时，向分布式存储云平台提供的个人信息；</p>

      <p class="p indent">
        5.1.2
        用户在使用分布式存储云平台及/或储算科技公司服务、参加网站活动或访问网站网页时，分布式存储云平台及/或储算科技公司自动接收并记录的用户浏览器端或手机客户端数据，包括但不限于IP地址、网站Cookies中的资料及用户要求取用的网页记录；
      </p>

      <p class="p indent">5.1.3 储算科技公司从商业伙伴处合法获取的用户个人信息；</p>

      <p class="p indent">5.1.4 储算科技公司通过其他合法途径获取的用户个人信息。</p>

      <p class="p">5.2 在下述法定情况下，用户的个人信息将会被部分或全部披露：</p>

      <p class="p indent">5.2.1 经用户同意向用户本人或其他第三方披露；</p>

      <p class="p indent">5.2.2 根据法律、法规等相关规定，或行政机构要求，向行政、司法机构或其他法律规定的第三方披露；</p>

      <p class="p indent">
        5.2.3 其他储算科技公司根据法律、法规等相关规定进行的披露。</p>
      <p class="p">
        5.3 用户同意并授权储算科技公司有权在为用户服务之目的下收集、使用、提供或以其他合法方式同步用户及其关联方相关个人信息，包括但不限于如下信息：</p>
      <p class="p indent">
        5.3.1 用户身份信息，包括但不限于姓名/名称、证件号码、证件类型、住所地、电话号码、账户认证信息、电子邮箱地址、生物特征以及其他身份信息；</p>
      <p class="p indent">
        5.3.2 用户访问分布式存储云平台时的操作日志，包括但不限于用户计算机IP地址、设备标识符、硬件型号、操作系统版本、用户位置信息以及其他相关的日志信息；</p>
      <p class="p indent">
        5.3.3 用户申请服务时所提供、形成的任何数据和信息，包括交易相关行为信息、个人填写的资料，紧急联系人及服务过程中告知分布式存储云平台及/或储算科技公司的其他联系人信息等；</p>
      <p class="p indent">
        5.3.4 用户信用信息，包括但不限于用户的征信记录和信用报告；</p>
      <p class="p indent">
        5.3.5
        用户财产信息，包括但不限于用户财税信息、房产信息、车辆信息、基金、保险、股票、信托、债券等投资理财信息和负债信息等；用户同意并确认，在将前述信息提供给分布式存储云平台及/或储算科技公司之前已清楚知晓可能带来的不利后果，包括但不限于基于前述信息做出的负面评价；
      </p>
      <p class="p indent">
        5.3.6 用户在下载、安装、使用分布式存储云平台及/或储算科技公司旗下平台移动端过程中授权或同意分布式存储云平台及/或储算科技公司搜集或使用的信息。</p>
      <p class="p indent">
        5.3.7 用户在行政机关、事业单位、司法机关、监管部门、互联网金融协会等行业自律组织或其他合法有权机构留存的任何信息，包括但不限于户籍信息、诉讼信息、执行信息和违法犯罪信息等；
      </p>
      <p class="p indent">
        5.3.8 用户授权分布式存储云平台及/或储算科技公司查询其社保信息，包括但不限于参保状态、缴费额度、缴费年限、缴费单位等；</p>
      <p class="p indent">
        5.3.9 与分布式存储云平台及/或储算科技公司提供服务相关的、用户留存在其他自然人、法人和组织的其他相关信息。</p>

      <div class="h1">六、用户的限制及义务</div>

      <p class="p">
        6.1
        用户应向分布式存储云平台及/或储算科技公司提供详尽、真实、准确和完整的资料。如身份信息、住址、工作地址、联系方式等发生变化，应在变更后3个工作日内通知分布式存储云平台及/或储算科技公司，包括但不限于登陆分布式存储云平台、拨打分布式存储云平台客服电话等进行修改。若用户提供任何错误、不实、过时或不完整的资料，并为分布式存储云平台及/或储算科技公司所确知，储算科技公司有权暂停或终止为用户提供服务，并拒绝现在或将来为其提供本服务的全部或部分。在此情况下，用户可通过网站的申诉途径与储算科技公司取得联系并修正个人资料经储算科技公司核实后恢复服务使用。
      </p>
      <p class="p">
        6.2 用户不得利用分布式存储云平台及/或储算科技公司提供的服务从事违反法律法规的活动。不得利用分布式存储云平台及/或科技提供服务的相关渠道制作，复制和传播以下信息：</p>
      <p class="p indent">
        6.2.1 煽动抵抗，破坏宪法和法律，行政法规；煽动颠覆国家政权，推翻国家制度；破坏民族团结。</p>
      <p class="p  indent">
        6.2.2 捏造或歪曲事实，散布谣言，扰乱社会秩序。</p>
      <p class="p indent">
        6.2.3 宣传封建迷信，淫秽，色情，赌博，暴力，谋杀，恐怖，教唆。</p>
      <p class="p indent">
        6.2.4 公然侮辱他人或捏造事实。</p>
      <p class="p indent">
        6.2.5 损害国家机关的公信力。</p>
      <p class="p indent">
        6.2.6 其他违反适用法律法规的行为。</p>
      <p class="p">
        6.3
        用户清楚明白应完全承担通过使用分布式存储云平台及/或储算科技公司所提供的服务而产生的收益的相关税收义务。用户同意并承诺仅仅在为自己的利益使用分布式存储云平台及/或储算科技公司所提供的服务，并未代他人或为了其他第三方的利益而使用本协议项下的服务内容。
      </p>
      <p class="p">
        6.4 用户同意在发现或怀疑其他用户违反本协议相关约定或存在任何欺诈或不当行为时及时与分布式存储云平台或储算科技公司联系。</p>
      <p class="p">
        6.5
        用户不得以任何方式恶意注册本网站账户，包括但不限于多个账户注册以获取利润和奖励。用户不应该窃取其他用户账户信息或进行其他影响其他用户账户安全的行为。用户不得使用任何方法来屏蔽自己的互联网流量和IP地址（例如Proxy，Tor，VPN等）或使用其他隐藏用户真实互联网连接的技术服务。
      </p>
      <p class="p">
        6.6
        在储算科技公司所提供服务的展示任何内容的知识产权，包括但不限于文章，图片，新闻，材料，网站结构，网站布置，网站设计，除非特别说明，均由储算科技公司完全拥有，用户应尊重储算科技公司的知识产权。
      </p>
      <p class="p">
        6.7
        未经储算科技公司授权或允许，用户不得以分布式存储云平台及/或储算科技公司的名义和/或使用分布式存储云平台的信息/数据从事任何商业活动或谋取利益。用户承诺并保证使用储算科技公司提供的租赁服务不会对储算科技公司的声誉造成负面影响或使得储算科技公司及/或分布式存储云平台承担法律责任或其他处罚，制裁。
      </p>
      <p class="p">
        6.8
        如果用户违反上述规定，储算科技公司保留权利直接采取一切必要措施取消用户违规所带来的利益，包括但不限于取消用户获得的评级、积分以及虚拟财富，暂停或终止对用户提供服务，取消因违规所获利益，乃至通过诉讼形式追究用户法律责任等。
      </p>

      <div class="h1">七、其他约定</div>

      <p class="p">
        7.1
        侵权投诉：任何第三方认为用户利用储算科技公司侵害其本人民事权益或实施侵权行为的，被侵权人有权书面通知储算科技公司采取删除、屏蔽、断开链接、停止服务等必要措施，储算科技公司有权根据第三方请求的合理性对用户的信息进行相应的处理。
      </p>
      <p class="p">
        7.2 适用法律：用户和储算科技公司发生争议的，应首先本着诚信原则通过协商加以解决。如果协商不成，则应向香港高等法院或香港其他具有管辖权的法院或仲裁机构提起诉讼。</p>
      <p class="p">
        7.3 可分割：如果本协议的任何条款被视为不合法、无效或因任何原因而无法执行，则此相应条款应视为可分割，不影响任何其他条款的法律效力。</p>
      <p class="p">
        7.4 冲突选择：本协议是储算科技公司与用户之间的重要法律文档，储算科技公司或者用户的任何其他书面或者口头意思表示与本协议不一致的，均应当以本协议为准。</p>

      <!-- <div class="h1">合作方式</div>
      <div class="h2">一、渠道推广合作</div>
      <div class="h3">合作对象: </div>
      <p>例如但不限于矿池、交易所、钱包、媒体、社群论坛、社交媒体、互联网金融平台、广告联盟等平台方。</p>
      <div class="h3">返佣方式:</div>
      <p>1、返佣比例超高订单返还比例高，等级越高，返还越多</p>
      <p>2、180天超长关联新客注册成功即建立180天关联</p>

      <div class="h2">二、推广流程</div>
      <div class="h3">1、加入推荐体系</div>
      <p>注册账号，完成个人实名认证</p>

      <div class="h3">2、分享推广</div>
      <div class="h4">合作方式:</div>
      <p>以CPS广告导流为主，渠道合作伙伴提供广告位，向IPFSCloud官网 或活动页导流。</p>
      <p>线上代理: 销售代理在自己的站点售卖IPFSCloud的产品，IPFSCloud将 提供强大的技术支持服务，帮助代理商快速搭建分销站，轻松获得分销回报。</p>
      <p>线下代理: 销售代理直接售卖IPFSCloud官网的商品，直接获得分销回报。</p>
      <p>销售代理直接售卖IPFSCloud官网的商品，直接获得分销回报。</p>

      <div class="h3">3、新客注册下单</div>
      <p>新客登入推广页面，180天内下单即返现</p>

      <div class='h3'>4、次月发放奖励</div>
      <p class='p'>推广成功，次月即发放奖励</p>

      <div class="h1">可通过以下方式接洽商务人员</div>
      <p class='p1'>邮箱：235922345@qq.com</p>
      <p class='p1'>二维码：</p>
      <img src="" class='qrcode' alt=""> -->

    </div>
    <Footer></Footer>
  </div>
</template>

<script>
import Header from '../../components/Header.vue'
import Footer from '../../components/Footer.vue'

export default {
  name: 'userProtocol',
  components: {
    Header,
    Footer,
  },
  mounted() {
    document.getElementById('app').scrollTop = 0
  }
}
</script>

<style lang="less" scoped>
.banner{
  height: 220px;
  width: 100%;
  text-align: center;
  font-size: 32px;
  font-weight: 500;
  line-height: 220px;
  background-color: #000000;
  color:#fff
}

.content-area{
  width:1200px;
  margin:0 auto;
  padding:48px 0 225px;
  font-size: 16px;
  font-weight: 400;
  color: #333333;
  line-height: 29px;
  .h1{
    margin-bottom:34px;
    font-size: 24px;
    font-weight: bold;
    line-height: 30px;
    padding-left:9px;
    line-height: 28px;
    border-left:4px solid @orange;
  }
  .p + .h1{
    margin-top:59px;
  }
  .p.indent{
    padding-left: 20px;
  }
  .h2{
    margin:41px 0 34px;
    font-size: 20px;
    line-height: 20px;
    font-weight: bold;
    line-height: 29px;
  }
  .h3{
    margin:32px 0 13px;
    font-size: 18px;
    line-height: 18px;
    font-weight: 500;
  }
  .h4{
    margin:18px 0 16px;
    font-size: 16px;
    line-height: 16px;
    font-weight: 500;
  }
  .p1{
    font-size: 18px;
    line-height: 20px;
    font-weight: 500;
    color: #333333;
  }
}
</style>